package com.fh.entity.qizhe;

import java.util.HashMap;
import java.util.LinkedHashMap;
import java.util.Map;

public class ProjectAuditHHZ {

    public static Map<String, String> PROJECT_INFO = new LinkedHashMap<>();

    public static Map<String, String> UPPER_CASE_INFO = new HashMap<>();

    public static Map<String, String> PROJECT_HELP = new HashMap<>();

    static {
        PROJECT_INFO.put("a01", "顾客进出入门店时，有迎宾员主动与顾客互动，必须有接待声，无漠视 ");
        PROJECT_INFO.put("a02", "工作人员态度良好、礼貌规范（三米原则）   ");
        PROJECT_INFO.put("a03", "工作人员仪容仪表整洁规范");
        PROJECT_INFO.put("a04", "工作人员仪态良好，站姿、坐姿端正，无趴柜、靠柜、坐岗，无聚集聊天或把玩手机的现象   ");
        PROJECT_INFO.put("a05", "工作人员有效提供问询解答");
        PROJECT_INFO.put("a06", "工作人员主动介绍产品");
        PROJECT_INFO.put("a07", "工作人员能主动为顾客提供购物车、购物栏");
        PROJECT_INFO.put("a08", "工作人员第一时间为首次进店顾客开通会员");
        PROJECT_INFO.put("b01", "门店店招logo干净整洁无污损；");
        PROJECT_INFO.put("b02", "门店外围干净整洁、无杂物（地面、墙面、橱窗），橱窗陈列主题突出；");
        PROJECT_INFO.put("b03", "店堂照明全部开启，店堂明亮、无故障；");
        PROJECT_INFO.put("b04", "电视屏正常开启播放；");
        PROJECT_INFO.put("b05", "店内背景音乐正常播放，音量较为合适；");
        PROJECT_INFO.put("b06", "店内清洁，地面无水渍、污渍、杂物，货架及商品干净无落灰");
        PROJECT_INFO.put("b07", "门店购物车、购物篮摆放整齐、表面干净无污渍且无破损，使用状况良好");
        PROJECT_INFO.put("b08", "门店通道通畅、无商品落地堵塞通道阻碍顾客通行");
        PROJECT_INFO.put("b09", "消防通道通畅，消防栓、防火卷帘门不被遮挡");
        PROJECT_INFO.put("c01", "商品陈列整齐、丰满，无散落商品；");
        PROJECT_INFO.put("c02", "货架层板间距合理，商品陈列顶层不得超过货架高度；");
        PROJECT_INFO.put("c03", "货架上不得陈列变质、包装破损、临过期商品");
        PROJECT_INFO.put("c04", "标价签应放置商品左下角，一货一签，货签对应，价签无缺失，缺货商品价签上需放置缺货标识； ");
        PROJECT_INFO.put("c05", "商品价签无错误、损毁，过期价签（黄价签上有活动时间段）；");
        PROJECT_INFO.put("c06", "地堆商品高度合理，不得直接落地，一个地堆组合不超过4个地堆");
        PROJECT_INFO.put("d01", "过期和破损物料及时撤除；");
        PROJECT_INFO.put("d02", "三级导视、云朵牌是否缺失或未按要求布展");
        PROJECT_INFO.put("d03", "门店各类促销布展物料摆放整齐、有氛围，不杂乱（促销氛围）");
        PROJECT_INFO.put("e01", "收银员结账服务准确快捷，唱收唱付，并主动推荐促销商品，结账完毕后，收银员主动将商品双手递交至顾客手上，并使用礼貌用语欢送顾客。");
        PROJECT_INFO.put("e02", "收银员无违规行为");
        PROJECT_INFO.put("e03", "收银台台面、收银台内部地面干净整洁；");
        PROJECT_INFO.put("e04", "收银台商品摆放整齐");
        PROJECT_INFO.put("f01", "配置是否齐全，日常用品是否完备");
        PROJECT_INFO.put("f02", "清扫是否彻底");
        PROJECT_INFO.put("f02", "安全设备是否完善");
        PROJECT_INFO.put("f04", "是否出现禁止事项");
        PROJECT_INFO.put("f05", "游乐区域内，地面及游乐设施无垃圾或污渍,无异常气味、怪味、或刺鼻味道，设备无安全隐患");
        PROJECT_INFO.put("f06", "游乐区域温馨提示标语无破损且显目无遮挡，价格牌及促销活动明确公示");
        PROJECT_INFO.put("f07", "每日消毒牌更新");
        PROJECT_INFO.put("f08", "游乐园内有员工维护现场秩序");
        PROJECT_INFO.put("f09", "门店是否主动邀请使用自助购进行结算");
        PROJECT_INFO.put("f10", "结账是门店是否有人员主动邀请顾客出示并使用电子会员卡");
        PROJECT_INFO.put("f11", "是否存在飞单情况");
        PROJECT_INFO.put("f12", "是否存在盗用顾客账号");



        for (String key : PROJECT_INFO.keySet()) {
            UPPER_CASE_INFO.put(key, key.toUpperCase());
        }


       PROJECT_HELP.put("a01", "当顾客进出入门店时，迎宾员要主动与顾客打招呼符合迎宾三部曲，\n" + "1.招呼“你好，欢迎光临”；\n" + "2.递送本档期海报；\n" + "3.介绍全场活动\n"
           + "出现不符则不得分（若没有迎宾员则直接扣分）");
        PROJECT_HELP.put("a02", "工作人员对视线内的顾客严格执行三米原则：\n" + "三米内自然微笑\n" + "目视顾客，在距离其1米左右的距离15°弯腰，亲切问候：“欢迎光临苏宁红孩子！”\n"
            + "一人执行不到位，扣2分，三人以上不得分。");
        PROJECT_HELP.put("a03", "女员工长发过肩要扎系，男员工不留胡须，不留长发，鬓角不过耳（要保持手部清洁干净,女收银员除涂无色指甲油以外，不得使用浓艳色彩的指甲油，女士必须化淡妆，不可浓妆艳抹，标新立异）一人不到位，不得分。");
        PROJECT_HELP.put("a04", "一人不到位，不得分。");
        PROJECT_HELP.put("a05", "工作人员在遇到询问时（例如询问某商品的位置、价格、产品功能等），能够清晰和正确、熟练地解答，一人不到位不得分");
        PROJECT_HELP.put("a06", "只要顾客在产品前驻足观看超过1分钟，工作人员能够主动上前为顾客介绍产品，说明产品的特色及功能，或主动为顾客推荐其他商品，超过三分钟无人服务不得分");
        PROJECT_HELP.put("a07", "当顾客携带2件商品（含2件）以上时，门店工作人员主动为顾客递上购物车或购物篮，任意一人不符则不得分");
        PROJECT_HELP.put("a08", "工作人员会使用红掌柜，并第一时间为首次进店顾客开通会员，任意一人不符则不得分");

        PROJECT_HELP.put("b01", "logo外观干净，招牌无破损，能正常使用，logo保持常亮状态，并且logo内无阴影出现，任意一项出现不符则不得分。");
        PROJECT_HELP.put("b02", "店外外围墙面和橱窗玻璃无破损、手印及明显灰尘，橱窗内陈列整洁，不杂乱，任意一项出现不符则不得分。");
        PROJECT_HELP.put("b03", "店内照明全开，店内照明灯无损坏，超过三处照明灯损坏或未开启不得分。");
        PROJECT_HELP.put("b04", "门店所有电视均正常打开，一台不开不得分");
        PROJECT_HELP.put("b05", "店内一定要有背景音乐播放，并且播放的音乐音量适中，无嘈杂声响，不影响员工与顾客沟通，不符则不得分（无音乐播放不得分）　");
        PROJECT_HELP.put("b06", "卖场无异味，地面无大片水渍和污渍，无杂物、废弃纸箱、垃圾，天花板无残留鱼线，靠墙围板清洁,无灰尘、无蜘蛛网，货架及商品上无落灰，任意一项不符合则不得分，如果有以上项目能在5分钟内清理完毕，则不扣分。　");
        PROJECT_HELP.put("b07", "门店购物车、购物篮表面干净无污渍且无破损购物车、且购物车使用状况良好。购物篮供顾客使用，购物车、购物篮需集中摆放，顾客丢弃的购物车/购物篮应在10分钟内归位，任意一条不符则不得分。　");
        PROJECT_HELP.put("b08", "购物区域内的通道保持畅通可通行，即使有员工上货，货品也要靠边堆放，至少能保留通道60CM以上，若通道可通行区域低于60CM则不得分（60CM按照通道120CM为标准，如果未达到120CM,则按照1/2通道考核）");
        PROJECT_HELP.put("b09", "门店防火卷帘门下面无物品遮挡，消防栓、灭火器面前30厘米不得有物品遮挡，消防通道无物品堆积一条不符则不得分。");

        PROJECT_HELP.put("c01", "购物区域内的货架、展台(蛋糕塔）、堆头等商品陈列整齐、丰满，无散落（例如服纺叠放的商品被打开，或货架、花车、地堆上的商品散落在地上等），散落商品应在10分钟内整理归位否则不得分。　");
        PROJECT_HELP.put("c02", "货架顶层商品陈列高度统一，顶层商品高度不得高于货架背板顶部，商品与货架上层板之间保持两指距离;背板不裸露，不符合则不得分。");
        PROJECT_HELP.put("c03", "临期商品：（1）保质期低于12个月的商品应与临期1个月以前下架，（2）保质期在12个月（含）以上的商品应与临期45天以前下架，发现一个商品不合规不得分。");
        PROJECT_HELP.put("c04", "商品应左下角放置标价签，一货一签，货签对应，缺货商品按照由左至右拉牌面的原则进行拉面，并保留价签，价签上放置此货暂缺标识，不得出现有货无签，有签无货，一处不到位不得分。");
        PROJECT_HELP.put("c05", "商品价签不得手写，无破损，价签所标价格与商品实际付款价格相符，出现问题不得分　");
        PROJECT_HELP.put("c06", "门店地堆商品陈列不得直接落地，高度不得高于1.5米；地堆组合数量不超过4个，且排放有序、醒目，避免无效堆码，一处不符合则不得分；");

        PROJECT_HELP.put("d01", "1、四季布展物料均在对应季节进行布展（春季：2月初-4月底，秋季：5月初-8月底，夏季：9月初-11月底，冬季：12月初-1月底）；\n"
            + "2、及时撤除不在对应促销活动档期的促销物料或破损物料（看物料上标注日期）；\n" + "一处不到位不得分。　");
        PROJECT_HELP.put("d02", "　1.货架两端三级导视是否缺失，是否是按2.0美陈标准；\n" + "2.云朵牌是否按要求在货架两端头布展，是否整齐美观；");
        PROJECT_HELP.put("d03", "1、A2POP油画架：\n" + "门店所有A2POP画架的画板下沿距离地面60cm，且均在统一水平线上（重点检查服纺区域），朝向一致（主通道）；\n"
            + "2、A3POP架：\n" + "中岛货架端头摆放A3POP架，整体高度统一在1.5米（下沿），即在同一水平线上，且朝向一致（主通道）；\n"
            + "3、A4pop架：主要布展在货架端头上/花车/地堆/圆形围边中岛架，避免直接放在商品上；高度整体统一在45cm，朝向一致；\n"
            + "4、促销封套：分大小两种，小号放在中岛，大号在高背奶粉货架，一整节货架摆放最少不低于2个，最多不超过6种促销封套的布展；\n" + "一处不到位扣1分，扣完为止。");

        PROJECT_HELP.put("e01", "收银员收银符合收银5部曲：\n" + "1.“您好，请问有红孩子会员卡吗？”\n" + "唱价\n" + "2.“这是我们公司的促销商品XXX，请问要买一件吗？”\n"
            + "3.“一共是X件商，一共XX钱。”\n" + "4.“收您XX钱”\n" + "5.“找您多少钱，请拿好小票，请您扫码评价赢云钻，对我们的服务进行评价！谢谢，请慢走！”\n"
            + "立地检查5笔收银，一人不到位扣2分　");
        PROJECT_HELP.put("e02", "收银员八不准，出现一处不得分，\n"
            +
            "1.不准在收银台内聊天、嘻笑、打闹；2.不准在当班擅自离台、离岗、停台；3.不准在款台内看书、看报、玩手机；4.不准以点款、结帐为借口，拒收和冷漠顾客；5.不准在款台内会客、吃东西、喝饮料，将水杯放在款台上；6.不准踢、蹬、翘、靠、坐收银台；7.不准未到下班时间私自关闭款台或拒收；8.不准出现对顾客争吵辱骂欧打现象。　");
        PROJECT_HELP.put("e03", "　无电线外露、设备破损；无漏水；防撞设施无缺失");
        PROJECT_HELP.put("e04", "1）门店、员工侵占使用，挪作仓库、茶水间、员工更衣室、休息室等违规行为；\n" + "2）男性员工进入");

        PROJECT_HELP.put("f01", "游乐区域内，地面及游乐设施无垃圾或污渍,无异常气味、怪味、或刺鼻味道，设备无安全隐患，一条不符则不得分。");
        PROJECT_HELP.put("f02", "　游乐区域温馨提示标语无破损且显目无遮挡，价格牌及促销活动明确公示，一条不符则不得分。");
        PROJECT_HELP.put("f03", "　消毒日期必须为当日日期，否则不得分");
        PROJECT_HELP.put("f04", "游乐园内有员工维护现场秩序，小孩有家长看护，不符合则不得分。");
        PROJECT_HELP.put("f05", "1.门店是否主动邀请使用自助购进行结算");
        PROJECT_HELP.put("f06", "2.结账是门店是否有人员主动邀请顾客出示并使用电子会员卡　");
        PROJECT_HELP.put("f07", "重点检查有厂促和服纺品类");
        PROJECT_HELP.put("f08", "针对活动仅限一次或想使用会员券，询问销售员/收营员可不可以用他人的账号");


    }
}
